// Напишите программу, которая на вход принимает число и выдает его в квадрат (число умноженное само на себя)
Console.Write("Введите целое число: ");
int namber = int.Parse(Console.ReadLine());
int resault = namber * namber;
Console.WriteLine(resault);